class MainPageConstants:
    QUESTION_ONE_ANSWER = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    QUESTION_TWO_ANSWER = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    QUESTION_THREE_ANSWER = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    QUESTION_FOUR_ANSWER = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    QUESTION_FIVE_ANSWER = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    QUESTION_SIX_ANSWER = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    QUESTION_SEVEN_ANSWER = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    QUESTION_EIGHT_ANSWER = "Да, обязательно. Всем самокатов! И Москве, и Московской области."

class OrderPageConstants:
    NAME = ["Даша", "Маша"]
    SURE_NAME = ["Смирнова", "Петрова"]
    ADDRESS = ["Московская, 5", " Очаковская, 73"]
    PHONE = ["+71234567890", "+70987654321"]
    COMMENT = ["Позвонить за 15 минут", "Не звонить"]

class URLSConstants:
    START_PAGE = "https://qa-scooter.praktikum-services.ru/"
    DZEN_URL = "https://dzen.ru/?yredirect=true"